/* ************************************************************************** */
/*                                                                            */
/*                                                        :::      ::::::::   */
/*   ft_putchar_fd.c                                    :+:      :+:    :+:   */
/*                                                    +:+ +:+         +:+     */
/*   By: jlim <jlim@student.42seoul.kr>             +#+  +:+       +#+        */
/*                                                +#+#+#+#+#+   +#+           */
/*   Created: 2020/12/29 18:26:37 by jlim              #+#    #+#             */
/*   Updated: 2020/12/29 18:35:26 by jlim             ###   ########.fr       */
/*                                                                            */
/* ************************************************************************** */

#include "libft.h"

/// @brief 특정 파일디스크립터에 문자를 출력한다.
/// @param 문자
/// @param 파일디스크립터
void ft_putchar_fd(char c, int fd)
{
	write(fd, &c, 1);
}
